const Isim = () => {
  return (
    <div>
      <div>اسم</div>
      <div>نحو</div>
      <p>
        المعرب من الأسماء ثلاثة الأسماء الرفوعة والأسماء المنصوبة والأسماء المجرورة، أما الأسماء المرفوعة سبعة مبتدأ وخبر
        وفاعل ونائب فاعل واسم كان وخبر إن والتوابع وأما الأسماء المنصوبة ثمانية مفاعيل خمسة ومستثنى ومنادى وخبر كان واسم إن
        والحال والتمييز والتوابع والأسماء المجرورة اثنان مجرور بحرف الجر ومجرور بالإضافة. والمبني من الأسماء ثمانية وهي
        الضمائر وأسماء الإشارة وأسماء الشرط وأسماء الاستفهام وأسماء الأفعال والأسماء الموصوفة والأعداد المعينة وبعض الظروف
      </p>
      <div>صرف</div>
      <p>
        تصنيف الأسماء من حيث قواعد الصرف سبعة وهي من حيث بنيته صحيح وغير صحيح ومقصور ومنقوص وممدوح نحو رجل وفتى وقاضى وحمراء
        ومن حيث تعيينه نكرة ومعرفة ضمير وعلم كريم وكنية ولقب وإشارة وموصول وأل نحو أسد وهو وفاطمة وأبو بكر والأمين وهذا والذي
        والرجل ومن حيث نوعه مذكر ومؤنث وتاء التأنيث وألف مقصور وألف منقوص والآخر نحو رجل وفاطمة وذكرى وحمراء وعين ومعاوية ومن
        حيث عدده مفرد ومثنى مقصور ومنقوص وممدوح وجمع مذكر سالم ممدود منقوص مقصور ومؤنس سالم وتكثير قلة وتكسير كثرة نحو علي
        عصى عصوان عصوين ومحامي ومحاميان ومحاميين وخضراء وخضراوان وخضراوين وفضاء وفضاءان وفضائين وبناء وبنائين وبناؤون وبنائين
        وأعلى وأعلون وأعلين وباقى وباقون وباقين وعصا وعصوات وجارى وجاريات وإنشاء وإنشاءات وأنفس وأعناب وأطعمة وفتية وطلبة
        أفعل وأفعال وأفلعة وفعلة وطلبة وشرفاء وقضاء وكتاب وأقوياء فعلة فعلاء فعلة أفعلاء وحمرة ومرضى وجبار وقلوب فعل وفعلى
        وفعال وفعول وعصافير وجواهر وأعاظم وأناشد ورسائل ومذاهب ومفاتيح فعاليل وفواعل وأفاعل وأفاعيل وفعائل ومفاعل ومفاعيل
      </p>
    </div>
  );
};

export default Isim;
