const KaidahHome = () => {
  return (
    <div>
      <div>مقدمة</div>
      <div>نحو</div>
      <p>
        الجملة قسمان جملة مفيدة وشبه جملة، فالجملة المفيدة ثلاثة أقسام الجملة الاسمية أي مبدأ وخبر وتكملة نحو زيد قائم في
        البيت والجملة الفعلية أي فعل وفاعل وتكملة نحو قام زيد في البيت وشبه جملة أي جار ومجرور أو ظرف أو مفرد أي اسم معرب أو
        مبني أو مصدر مؤول من أن والفعل أو أن واسمها وخبرها
      </p>
      <div>صرف</div>
      <p>
        والجملة التي لها محل من الإعراب هي خبر لمبتدأ أو كان إن إن نحو هو يدرس وكان يدرس وإنه يدرس، ومفعول به نحو قلت هو طالب
        ونعت نحو سمعت طيورا تغرد وحال نحو سمعت الطيور تغرد وجواب شرط مقترن بالفاء نحو من جد فالنجاح حليفه ومضاف إليه أن لا
        تكون إلا بعد حيث وإذ وإذا نحو ذهبت إلى حيث تقوم وتابع لجملة لها محل من الإعراب نحو هو يدرس ويلعب، والجملة التي لا محل
        لها من الإعراب هي التي تقع في أول الكلام نحو لا تكذب والتي منقطعة عما قبلها نحو لا تكذب إن الكذب مكروه والتي تقع صلة
        الموصولة نحو جاء الذي يذرس وجواب الشرط غير الجازم نحو لولا الهواء ما عاش كائن حي وجواب الشرط الجازم غير مقترنة بالفاء
        نحو كيفما تعامل الناس يعاملك والجملة الاعتراضية نحو كان - رحمه الله - قدوة الحسنة والجملة المفسرة نحو نظرت إليه شزر
        أي اختقرته والجملة التالية لجملة لا محل لها من الإعراب نحو ذهبت إلى المنزل وتناولت الطعام
      </p>
    </div>
  );
};

export default KaidahHome;
